# FbxLightInitialIntensity Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightInitialIntensity Property
ParameterTypeId Class See Also
---
"Initial Intensity"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightInitialIntensity { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightInitialIntensity As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightInitialIntensity {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace